@extends('layouts.web')

@section('title', 'Наши преимущества')

@section('content')

<main class="main">
    <div class="intro">

        @include('includes.header')

        <div class="intro__inner container">
            <p class="pageTitle">{{ translation('main.advantages') }}</p>
            <div class="pageNavigation">
                <span class="pageNavigation__text"><a href="{{ route('index') }}">{{ translation('main.mainPage') }}</a></span>
                <span class="pageNavigation__text">/</span>
                <span class="pageNavigation__text blue">{{ translation('main.advantages') }}</span>
            </div>
        </div>
        <div class="bgTomchiBlack">
            <span></span>
            <span></span>
            <span></span>
            <span></span>
            <span></span>
        </div>
    </div>
    <div class="content">
        <div class="container">
            <div class="topButtonsDiv">
                @foreach($categories as $category)
                <p class="topButton {{ $loop->first ? 'active' : '' }}">{{ isset($category->title[app()->getLocale()]) ? $category->title[app()->getLocale()] : $category->title[$main_lang->code] }}</p>
                @endforeach
            </div>
            @foreach($categories as $category)
            <div class="contentContainer {{ $loop->first ? 'active' : '' }}">
                <p class="topTitle">{{ isset($category->title[app()->getLocale()]) ? $category->title[app()->getLocale()] : $category->title[$main_lang->code] }}</p>
                <div class="advantagesList">
                    @foreach($category->advantages as $item)
                    <div class="advantage">
                        <div class="advantageTop">
                            <div class="advantageContent">
                                <p class="advantageNumber">{{ $loop->iteration < 10 ? '0' : '' }}{{ $loop->iteration }}</p>
                                <p class="advantageTitle">{{ isset($item->title[app()->getLocale()]) ? $item->title[app()->getLocale()] : $item->title[$main_lang->code] }}</p>
                            </div>
                            <svg class="accrodionArrow" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                            </svg>
                        </div>
                        <div class="advantageBottom">
                            <div class="advantageBottom__top">
                                <div class="advantageContent__active">
                                    <p class="advantageNumber__active">01</p>
                                    <div class="advantage__activeTexts">
                                        <p class="advantageTitle__active">{{ isset($item->title[app()->getLocale()]) ? $item->title[app()->getLocale()] : $item->title[$main_lang->code] }}</p>
                                        <p class="advantageSubtitle">{!! isset($item->desc[app()->getLocale()]) ? $item->desc[app()->getLocale()] : $item->desc[$main_lang->code] !!}</p>
                                    </div>
                                </div>
                                <svg class="accrodionArrow__active" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                                </svg>
                            </div>
                            <img src="{{ default_img($item->lg_img) }}" alt="background">
                        </div>
                    </div>
                    @endforeach
                </div>
            </div>
            @endforeach
            <!-- <div class="contentContainer">
                <p class="topTitle">Для того чтобы продлить срок службы фургона, применяются исключительно качественные материалы и современные технологии:</p>
                <div class="advantagesList">
                    <div class="advantage">
                        <div class="advantageTop">
                            <div class="advantageContent">
                                <p class="advantageNumber">01</p>
                                <p class="advantageTitle">Надрамник</p>
                            </div>
                            <svg class="accrodionArrow" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                            </svg>
                        </div>
                        <div class="advantageBottom">
                            <div class="advantageBottom__top">
                                <div class="advantageContent__active">
                                    <p class="advantageNumber__active">01</p>
                                    <div class="advantage__activeTexts">
                                        <p class="advantageTitle__active">Утеплитель</p>
                                        <p class="advantageSubtitle">Пенополистирол экструдированный с высокой механической прочностью (сжатие, разрыв, изгиб, сдвиг). Он поглощает большую часть динамических нагрузок, вызванных ветром и вибрацией.</p>
                                    </div>
                                </div>
                                <svg class="accrodionArrow__active" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                                </svg>
                            </div>
                            <img src="./media/gif.gif" alt="background">
                        </div>
                    </div>
                    <div class="advantage">
                        <div class="advantageTop">
                            <div class="advantageContent">
                                <p class="advantageNumber">02</p>
                                <p class="advantageTitle">Утеплитель</p>
                            </div>
                            <svg class="accrodionArrow" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                            </svg>
                        </div>
                        <div class="advantageBottom">
                            <div class="advantageBottom__top">
                                <div class="advantageContent__active">
                                    <p class="advantageNumber__active">02</p>
                                    <div class="advantage__activeTexts">
                                        <p class="advantageTitle__active">Утеплитель</p>
                                        <p class="advantageSubtitle">Пенополистирол экструдированный с высокой механической прочностью (сжатие, разрыв, изгиб, сдвиг). Он поглощает большую часть динамических нагрузок, вызванных ветром и вибрацией.</p>
                                    </div>
                                </div>
                                <svg class="accrodionArrow__active" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                                </svg>
                            </div>
                            <img src="./media/gif.gif" alt="background">
                        </div>
                    </div>
                </div>
            </div>
            <div class="contentContainer">
                <p class="topTitle">Протоколы испытаний на соответствие требованиям ATP (СПС) в сертифицированной лаборатории подтверждают высокие теплоизоляционные свойства:</p>
                <div class="advantagesList">
                    <div class="advantage">
                        <div class="advantageTop">
                            <div class="advantageContent">
                                <p class="advantageNumber">01</p>
                                <p class="advantageTitle">Надрамник</p>
                            </div>
                            <svg class="accrodionArrow" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                            </svg>
                        </div>
                        <div class="advantageBottom">
                            <div class="advantageBottom__top">
                                <div class="advantageContent__active">
                                    <p class="advantageNumber__active">01</p>
                                    <div class="advantage__activeTexts">
                                        <p class="advantageTitle__active">Утеплитель</p>
                                        <p class="advantageSubtitle">Пенополистирол экструдированный с высокой механической прочностью (сжатие, разрыв, изгиб, сдвиг). Он поглощает большую часть динамических нагрузок, вызванных ветром и вибрацией.</p>
                                    </div>
                                </div>
                                <svg class="accrodionArrow__active" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                                </svg>
                            </div>
                            <img src="./media/gif.gif" alt="background">
                        </div>
                    </div>
                    <div class="advantage">
                        <div class="advantageTop">
                            <div class="advantageContent">
                                <p class="advantageNumber">02</p>
                                <p class="advantageTitle">Утеплитель</p>
                            </div>
                            <svg class="accrodionArrow" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                            </svg>
                        </div>
                        <div class="advantageBottom">
                            <div class="advantageBottom__top">
                                <div class="advantageContent__active">
                                    <p class="advantageNumber__active">02</p>
                                    <div class="advantage__activeTexts">
                                        <p class="advantageTitle__active">Утеплитель</p>
                                        <p class="advantageSubtitle">Пенополистирол экструдированный с высокой механической прочностью (сжатие, разрыв, изгиб, сдвиг). Он поглощает большую часть динамических нагрузок, вызванных ветром и вибрацией.</p>
                                    </div>
                                </div>
                                <svg class="accrodionArrow__active" viewBox="0 0 48 48" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M33.9999 18.3404C33.6252 17.9679 33.1183 17.7588 32.5899 17.7588C32.0615 17.7588 31.5546 17.9679 31.1799 18.3404L23.9999 25.4204L16.9199 18.3404C16.5452 17.9679 16.0383 17.7588 15.5099 17.7588C14.9815 17.7588 14.4746 17.9679 14.0999 18.3404C13.9124 18.5263 13.7637 18.7475 13.6621 18.9912C13.5606 19.2349 13.5083 19.4964 13.5083 19.7604C13.5083 20.0244 13.5606 20.2858 13.6621 20.5295C13.7637 20.7732 13.9124 20.9944 14.0999 21.1804L22.5799 29.6604C22.7658 29.8478 22.987 29.9966 23.2307 30.0982C23.4745 30.1997 23.7359 30.252 23.9999 30.252C24.2639 30.252 24.5253 30.1997 24.7691 30.0982C25.0128 29.9966 25.234 29.8478 25.4199 29.6604L33.9999 21.1804C34.1874 20.9944 34.3361 20.7732 34.4377 20.5295C34.5392 20.2858 34.5915 20.0244 34.5915 19.7604C34.5915 19.4964 34.5392 19.2349 34.4377 18.9912C34.3361 18.7475 34.1874 18.5263 33.9999 18.3404Z" fill="currentColor" />
                                </svg>
                            </div>
                            <img src="./media/gif.gif" alt="background">
                        </div>
                    </div>
                </div>
            </div> -->
        </div>
        <div class="bgTomchiWhite">
            <span></span>
            <span></span>
            <span></span>
            <span></span>
            <span></span>
        </div>
    </div>
</main>

@endsection

@section('scripts')

<script src="{{ asset('client/js/advantages.js') }}"></script>

@endsection